
1- 'pycoders' isimli bir server kurun. (M)

2- 'class4' veritabanı olusturun (M). Veritabanı silindi (M). Ayni veri tabanı yine olusturun (K)

3- https://www.postgresqltutorial.com/postgresql-sample-database/ gidiş ve ER modelini kullanarak. Tablolar arasindaki en az 5 iliskiyi yazin.(Hangi tablodaki arasinda ne tur bir iliski var)

4- ER modeldeki tablolardan 3 tanesini M ile olusturun.

5- ER modeldeki tablolardan 3 tanesini K ile olusturun.

6- ER modeldeki tablolardan 3 tanesini C ile olusturun.

(4-5-6. sorulari cozerken toblolar arasındaki iliskileri gozardi edebilirsiniz.)

7- Olusturdugunuz 3 tabloya M ile 5 veri girişi yapin.

8- Olusturdugunuz 3 tabloya K ile 5 veri girişi yapin.

9- Olusturdugunuz 3 tabloya C ile 5 veri girişi yapin.

10- 3 tablodaki birer veriyi M ile degistirin.

11- 3 tablodaki birer veriyi K ile degistirin.

12- 3 tablodaki birer veriyi C ile degistirin.

13- 3 tablonun son satirini M ile silin.

14- 3 tablonun son satirini K ile silin.

15- 3 tablonun son satirini C ile silin.

16- 1 tabloyu M ile silin.

17- 1 tabloyu K ile silin.

18- 1 tabloyu C ile silin.

19- Kalan tablolardan 1 tanesinin 2 veya 3 sutununu K ile baska bir tablo olarak olusturun.

20- Kalan tablolardan 1 tanesinin 2 veya 3 sutununu C ile baska bir tablo olarak olusturun.

21- Tablolardan 1 tanesini truncate edin.

22- Tablolardan 1 tanesini truncate edin.

23- Tablolardan 1 tanesini truncate edin.

24- truncate edilmis tablolari M ile silin.

25- 2 tabloyu K ile silin.

26- 2 tabloyu C ile silin.

27- Elimizde veri olan 1 tablo kalmis olmasi lazim. Tabloyu csv olarak bilgisayarınıza yukleyin.

28- Postgresql dizinindeki son tabloyu da K ile silin.

29- Bilgisayarınızdaki csv yi arayuze import edin.

30- import ettiğiniz bu tabloyu C ile silin.

31- https://www.postgresqltutorial.com/postgresql-sample-database/ linkindeki ornek DB yi bilgisayariniza indirin ve arayuze yukleyin.

32- DB nizde 15 adet tablo olmasi lazim. Her tabloyu teker teker goruntuleyin ve kolon isimlerine bakarak, 5 tablodaki hangi kolonun PK ve FK olduğunu yazin.

(Asagi'deki sorularıin sayfasınıini ve bu cedakibi bulurken kullandiginiz kodlari yazin)

33- Aksiyon filmlerinin ortalama suresi ne kadardır?

34- En cok staff olan store hangisidir?

35- 'Gene Willis' adli aktörün filmlerinin reytingi nedir?

36- Aktif customer sayisi nedir?

37-'C' harfiyle baslayan filmler nelerdir?

38- 4$ den az odeme yapan musterilerin e-posta edresleri nedir?

39- Moskova'da ikamet eden staff ve customer tablosu? (sadece isim/soyisim sütünları olsun)

40- En az kiralanan 5 film?

41- 2006 yilinda yayinlanan ingilizce filmler hangileridir?

2- 'class4' veritabanı olusturun (M). Veritabanı silindi (M). Ayni veri tabanı yine olusturun (K)

CREATE DATABASE class4
    WITH
    OWNER = postgres
    ENCODING = 'UTF8'
    LC_COLLATE = 'English_Netherlands.1252'
    LC_CTYPE = 'English_Netherlands.1252'
    TABLESPACE = pg_default
    CONNECTION LIMIT = -1
    IS_TEMPLATE = False;

3- https://www.postgresqltutorial.com/postgresql-sample-database/ gidiş ve ER modelini kullanarak. Tablolar arasindaki en az 5 iliskiyi yazin.(Hangi tablodaki arasinda ne tur bir iliski var)

1-Catagory - Film_category  zero to one
2- FIlm - Inventory  one mandatory to many optional
3 - Customer - adress many to one 
4 -rental - staf  many to mandatory one
5 -adress to city  many to one

5- ER modeldeki tablolardan 3 tanesini K ile olusturun.

CREATE TABLE actor
(
    actor_id integer NOT NULL primary key,
    first_name varchar(20),
    last_name varchar(20) ,
    last_update time without time zone,
);

create table Films(
	film_id integer primary key,
	film_name varchar(20),
	last_update time
);
CREATE table inventory
(
    inventory_id integer primary key,
    film_id varchar(20),
    store_id integer,
    last_update time
);
CREATE table category
(
    catogort_id integer primary key,
    name varchar(20),
    last_update time
)
CREATE table film_category
(
    film_id varchar(20) primary key,
    category_id integer,
    last_update time
)

6- ER modeldeki tablolardan 3 tanesini C ile olusturun.

In [4]:
import psycopg2
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()
command = '''CREATE table category
(
    catogort_id integer primary key,
    name varchar(20),
    last_update time
)'''

cur.execute(command)
cur.close()
conn.commit()
conn.close()

In [5]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()
command = '''CREATE table inventory
(
    inventory_id integer primary key,
    film_id varchar(20),
    store_id integer,
    last_update time
)'''

cur.execute(command)
cur.close()
conn.commit()
conn.close()

In [7]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()
command = '''CREATE table film_category
(
    film_id varchar(20) primary key,
    category_id integer,
    last_update time
)'''

cur.execute(command)
cur.close()
conn.commit()
conn.close()

8- Olusturdugunuz 3 tabloya K ile 5 veri girişi yapin

insert into  actor (actor_id , first_name , last_name , last_update)  values (6 , 'ahmet' , 'tas', 'now' );
insert into  actor (actor_id , first_name , last_name , last_update)  values (7 , 'mehmet' , 'tas', 'now' );
insert into  actor (actor_id , first_name , last_name , last_update)  values (8 , 'ayse' , 'tas', 'now' );
insert into  actor (actor_id , first_name , last_name , last_update)  values (9 , 'fatma' , 'tas', 'now' );
insert into  actor (actor_id , first_name , last_name , last_update)  values (10 , 'osman' , 'tas', 'now' );

9- Olusturdugunuz 3 tabloya C ile 5 veri girişi yapin.

In [21]:

conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()


cur.execute('''insert into actor values(%s,%s,%s,%s)''', (11,"selim" , "yaman" , 'now'))
cur.execute('''insert into actor values(%s,%s,%s,%s)''', (13,"cuma" , "mubarek" , 'now'))
cur.execute('''insert into actor values(%s,%s,%s,%s)''', (12,"Anna" , "chorus" , 'now'))
cur.execute('''insert into actor values(%s,%s,%s,%s)''', (14,"kevin" , "joe" , 'now'))
cur.execute('''insert into actor values(%s,%s,%s,%s)''', (15,"Angelina" , "coli" , 'now'))
cur.close()
conn.commit()
conn.close()

11- 3 tablodaki birer veriyi K ile degistirin.

update actor set actor_name = 'Furkan'  where actor_id = 5
update actor set actor_surname = 'Yıgıt'  where actor_id = 5
update actor set last_update = 'now'  where actor_id = 5

12- 3 tablodaki birer veriyi C ile degistirin.

In [ ]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('''update actor set actor_isim = %s where id = %s''' ,('Furkan',2))
cur.execute('''update actor set actor_isim = %s where id = %s''' ,('osman',3))
cur.execute('''update actor set actor_isim = %s where id = %s''' ,('kemal',4))
cur.close()
conn.commit()
conn.close()

14- 3 tablonun son satirini K ile silin.
'delete from actor where actor_id = (select max(actor_id) from actor)'
'delete from films where actor_id = (select max(films_id) from films)'
'delete from country where country_id = (select max(country_id) from country)'

15- 3 tablonun son satirini C ile silin.

In [17]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('delete from actor where actor_id = (select max(actor_id) from actor)')
cur.execute('delete from films where actor_id = (select max(films_id) from films)')
cur.execute('delete from country where country_id = (select max(country_id) from country)')

cur.close()
conn.commit()
conn.close()

17- 1 tabloyu K ile silin.
'drop table film_category'

18-Deleting a table using python

In [20]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('drop table film_category')

cur.close()
conn.commit()
conn.close()

19- Kalan tablolardan 1 tanesinin 2 veya 3 sutununu K ile baska bir tablo olarak olusturun.

CREATE TABLE Actrist AS SELECT   * FROM actor WHERE actor_id = 1 or actor_id =2 ;

20- Kalan tablolardan 1 tanesinin 2 veya 3 sutununu C ile baska bir tablo olarak olusturun.

In [ ]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('CREATE TABLE Actrist AS SELECT   * FROM actor WHERE actor_id = 1 or actor_id =2')

cur.close()
conn.commit()
conn.close()

22- Tablolardan 1 tanesini truncate edin

TRUNCATE TABLE actors ;

23-Tablolardan 1 tanesini truncate edin.

In [ ]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('TRUNCATE TABLE actors')

cur.close()
conn.commit()
conn.close()

2 tabloyu K ile silin.
'drop table film_category'

26- 2 tabloyu C ile silin

In [ ]:
conn = psycopg2.connect("dbname = class4 user = postgres password = 123")
cur = conn.cursor()

cur.execute('drop table film_category')

cur.close()
conn.commit()
conn.close()

27- Elimizde veri olan 1 tablo kalmis olmasi lazim. Tabloyu csv olarak bilgisayarınıza yukleyin.

COPY actor TO 'C:\temp\actor_db.csv' DELIMITER ',' CSV HEADER;

29- Bilgisayarınızdaki csv yi arayuze import edin.

In [ ]:
with open(r"C:\Temp\actor_db.csv",'r') as f:
    for i in f:
        print(i)

32- DB nizde 15 adet tablo olmasi lazim. Her tabloyu teker teker goruntuleyin ve kolon isimlerine bakarak, 5 tablodaki hangi kolonun PK ve FK olduğunu yazin.

film --> film_id (PK) - language_id (FK)
category --> category_id (PK)
film_actor --> actor_id, film_id (PK) - actor_id, film_id (FK)                
address --> address_id (PK) - city_if (FK)
payment --> payment_id (PK) - customer_id, rental_id, staff_id (FK)

33- Aksiyon filmlerinin ortalama suresi ne kadardır?
- Film_category and film

SELECT AVG(length) FROM film WHERE film_id IN ( SELECT film_id FROM film_category WHERE category_id=1 );

111.60937

34- En cok staff olan store hangisidir?
-staff and store

    SELECT COUNT(staff_id) FROM staff GROUP BY store_id ORDER BY count LIMIT 1;

35- 'Gene Willis' adli aktörün filmlerinin reytingi nedir?
-film_actor , film ve actor

SELECT rating FROM film WHERE film_id IN 
( 
    SELECT film_id FROM film_actor 
    WHERE actor_id = (SELECT actor_id FROM actor WHERE first_name ='Gene' and last_name ='Willis') 
)

36- Aktif customer sayisi nedir?

SELECT COUNT(*) FROM customer WHERE active = 1;

37-'C' harfiyle baslayan filmler nelerdir?

SELECT title FROM film WHERE title LIKE 'C%';

4$ den az odeme yapan musterilerin e-posta edresleri nedir?

SELECT email FROM customer WHERE customer_id IN (SELECT customer_id FROM payment WHERE amount<4 );

39- Moskova'da ikamet eden staff ve customer tablosu? (sadece isim/soyisim sütünları olsun)

SELECT first_name,last_name FROM customer WHERE address_id IN (SELECT address_id FROM address WHERE city_id=(SELECT city_id FROM city WHERE city='Moscow'));
SELECT first_name,last_name FROM staff WHERE address_id IN (SELECT address_id FROM address WHERE city_id=(SELECT city_id FROM city WHERE city='Moscow'));

40- En az kiralanan 5 film?

CREATE TABLE new_table
AS SELECT film_id,COUNT(inventory_id) FROM inventory GROUP BY film_id ORDER BY COUNT LIMIT 5;

SELECT title FROM film WHERE film_id IN (SELECT film_id FROM new_table)

41- 2006 yilinda yayinlanan ingilizce filmler hangileridir?

SELECT title FROM film WHERE release_year=2006 and language_id=(SELECT language_id FROM language WHERE name='English');